<?php
/**
 *
 */
return array(
    'lang' => 'Русский',

    //reg
    'reg_info'=>'Чтобы продолжить, создайте аккаунт или войдите.',
    'email'=>'Электронный адрес',
    'not_pass'=>'Не можете войти?',
    'not_auth'=>'У вас ещё нет аккаунта?',
    'pass'=>'Пароль',
    'log_in'=>'Войти',
    'sign_up'=>'Зарегистрироваться',

    //app
    'Name'=>'Sura', //App Name

    //other
    'find'=>'Найти',
    'search'=>'Искать',
    'back'=>'Назад',
    'select_lang'=>'Выбор используемого языка на сайте',
    'help'=>'Помощь',
    'add'=>'Добавить',
    'remove'=>'Убрать',
    'edit'=>'Редактировать',
    'save'=>'Сохранить',
    'all'=>'Все',
    'attach'=>'Прикрепить',
    'to_page'=>'На страницу',
    'and'=>'и',
    'close'=>'Закрыть',
    'online' => 'Online',
    'no_infooo' => 'no_infooo',
    'no_upage' => 'no_upage',

    //footer
    'privacy'=>'Конфиденциальность',
    'terms'=>'Условия использования',
    'developers'=>'Разработчикам',
//    'help'=>'Помощь',

    //notifications
    'back_to_my_notify'=>'Вернуться к моим событиям',
    'all_notify'=>'Все события',


    //fast search
    'by_people'=>'по людям',
    'by_videos'=>'по видеозаписям',
    'by_groups'=>'по сообществам',
    'by_audios'=>'по аудиозаписям',

    //search
    'people'=>'Люди',

    //menu
    'my_page'=>'Моя Страница',
    'im'=>'Сообщения',
    'friends'=>'Друзья',
    'news_feed'=>'Лента',
    'settings'=>'Настройки',
    'balance'=>'Баланс',
    'exit'=>'Выход',
    'view_profile'=>'Посмотреть свой профиль',


    //story
    'story_create'=>'Создать историю',
    'story'=>'История',

    //wall
    'wall_text_default'=>'Что у Вас нового?',
    'publications'=>'Публикации',
    'wall_null'=>'На стене пока нет ни одной записи.',
    'wall_next'=>'к предыдущим записям',

    //news
    'news'=>'news',
    'news_next'=>'Показать предыдущие новости',

    //settings
    'settings_general'=>'Основные',
    'settings_privacy'=>'Приватность',
    'blacklist'=>'Черный список',
    'blacklist_num'=>'В Вашем черном списке находится',
    'blacklist_delete'=>'Удалить из списка',
    'notify'=>'Уведомления',

    //general
    'privacy_err_code1'=>'Код активации из письма с текущего почтового ящика принят. Осталось подтвердить код активации в письме, отправленном на новый почтовый ящик.',
    'privacy_err_code2'=>'Код активации из письма с нового почтового ящика принят. Осталось подтвердить код активации в письме, отправленном на текущий почтовый ящик.',
    'privacy_err_code3'=>'Адрес Вашей электронной почты был успешно изменен на новый.',
    'err_pass_1'=>'Пароль не изменён, так как прежний пароль введён неправильно.',
    'err_pass_2'=>'Пароль не изменён, так как новый пароль повторен неправильно.',
    'ok_pass'=>'Пароль успешно изменён.',
    'old_pass'=>'Старый пароль:',
    'new_pass'=>'Новый пароль:',
    'new_pass2'=>'Повторите пароль:',
    'saveNewPwd'=>'Изменить пароль',
    'edit_name'=>'Изменить имя',
    'err_name_1'=>'Специальные символы и пробелы запрещены.',
    'ok_name'=>'Изменения успешно сохранены.',
    'new_name'=>'Ваше имя:',
    'new_surname'=>'Ваша фамилия:',
    'email_edit'=>'Адрес Вашей электронной почты',
    'ok_email'=>'На <b>оба</b> почтовых ящика придут письма с подтверждением.',
    'err_email'=>'Неправильный email адрес',
    'email_old'=>'Текущий адрес:',
    'email_new'=>'Новый адрес:',
    'saveNewEmail'=>'Сохранить адрес',
    'time_title'=>'Региональные настройки',
    'ok_timez'=>'Часовой пояс успешно сохранён.',
    'time_zona'=>'Часовой пояс:',
    'time_zona_no_select'=>'- Не выбрано -',

    'remove_profile'=>'удалить свою страницу',
    'you_make'=>'Вы можете',

    //privacy
    'privacy_ok'=>'Новые настройки приватности вступили в силу.',
    'privacy1'=>'Кто может писать мне личные <b>сообщения</b>:',
    'privacy2'=>'Кто видит чужие записи на моей <b>стене</b>:',
    'privacy3'=>'Кто может оставлять сообщения на моей <b>стене</b>:',
    'privacy4'=>'Кто может комментировать мои <b>записи</b>:',
    'privacy5'=>'Кто видит основную информацию моей <b>страницы</b>:',
    'all_users'=>'Все пользователи',
    'all_friends'=>'Только друзья',
    'all_you'=>'Только я',
    'no_users'=>'Никто',

    //profile
    'update_photo'=>'Обновить фотографию',
    'edit_photo'=>'Изменить фотографию',
    'edit_min_photo'=>'Изменить миниатюру',
    'dell_min_photo'=>'Изменить миниатюру',
    'send_gift'=>'Отправить подарок',
    'write_message'=>'Написать сообщение',


    'subscribe'=>'Подписаться на обновления',
    'unsubscribe'=>'Отписаться от обновлений',
    'stats_profile'=>'Статистика страницы',
    'my_docs'=>'Мои документы',
    'edit_profile'=>'Редактировать страницу',
    'add_fave'=>'Добавить в закладки',
    'remove_fave'=>'Удалить из закладок',
    'fave' => 'Закладки',
    'block'=>'Заблокировать',
    'unblock'=>'Разблокировать',
    'profile_block'=>'ограничил(а) доступ к своей странице.',

    //happy
    'happy'=>'Дни рожденья друзей',

    'mutual'=>'Общие друзья',


    'subscriptions'=>'Подписки',

    'groups'=>'Сообщества',
    'videos'=>'Видеозаписи',
    'video'=>'Видео',

    'status_vallue'=>'Введите здесь текст Вашего статуса.',
    'status_public'=>'Рассказать друзьям',
    'set_status'=>'установить статус',

    'rating'=>'Рейтинг',

    'country'=>'Страна',
    'city'=>'Город',
    'birthday'=>'День рождения',
    'marital_status'=>'Семейное положение',

    'contacts_info'=>'Контактная информация',
    'mobile'=>'Моб. телефон',
    'vk'=>'В контакте',
    'ok'=>'Одноклассники',
    'fb'=>'FaceBook',
    'skype'=>'Skype',
    'icq'=>'ICQ',
    'web'=>'Веб_сайт',

    'private_info'=>'Личная информация',
    'work'=>'Деятельность',
    'Interests'=>'Интересы',
    'favorite_music'=>'Любимая музыка',
    'favorite_movie'=>'Любимые фильмы',
    'favorite_book'=>'Любимые книги',
    'favorite_game'=>'Любимые игры',
    'favorite_quote'=>'Любимые цитаты',
    'about'=>'О себе',

    //audio
    'audio'							=> 'Аудиозаписи',
    'music' => 'Музыка',
    'audio_none'					=> 'У Вас еще нет аудиозаписей',
    'audio_box_none'				=> '<div class="text-center" style="padding-top:10px;color:#777777;font-size:13px;">У Вас еще нет аудиозаписей.</div>',

    'albums'=>'Альбомы',
    'menu_albums'=>'Фотографии',

    //chats
    'chats'=>'Чаты',
    'im_info'=>'Вы можете выбрать собеседника из левой колоны и начать с ним общение.',

    //friends
    'friends_all'=>'Все друзья',
    'friends_online'=>'Друзья онлайн',
    'friends_requests'=>'Заявки в друзья',
    'friends_common'=>'Общие друзья',
    'friends_common_not'=>'У Вас с этим пользователем нет общих друзей.',
    'friend_remove'=>'Убрать из друзей',
    'no_requests' => 'no_requests',

    //balance
    'balance_status' => 'Состояние личного счёта',
    'balance_currency' => 'Голоса',
    'balance_currency_info' => 'это универсальная валюта для всех приложений на нашем сайте. Кроме этого, голосами можно оплатить подарки. Голосами нельзя оплатить рекламу. Обратите внимание, что услуга считается оказанной в момент зачисления голосов, возврат невозможен. Кроме этого за каждого приглашённого друга по вашей ссылке, вы будете получать по <b>10 голосов</b>, также каждый день на ваш счёт будет начислятся по <b>1 голосу</b>, если вы заходили в течении дня на сайт.',
    'my_currency'=>'На Вашем счёте',
    'currency'=>'голос',
    'currency_buy'=>'Купить голоса',
    'currency_replenish'=>'Пополнить баланс',
    'code_buy'=>'ПОПОЛНЕНИЕ БАЛАНСА С ПОМОЩЬЮ АКТИВАЦИИ КОДА',
    'code_activated'=>'Код успешно активирован!',
    'code_enter'=>'Введите код:',
    'code_activate'=>'Активировать',
    'currencys'=>'голосов',
    'balance_title'=>'Состояние личного счёта',


    //ref
    'friend_invite'=>'Пригласить друга',
    'friend_invited'=>'Приглашённые друзья',
    'friend_invite_info'=>'Инструкция по приглашению друга',
    'friend_invite_info2'=>'Для приглашения друга отправьте ему ссылку на регистрацию, которая указана ниже.',
    'friend_invite_info3'=>'Ваша ссылка для приглашения:',
    'friend_invite_info4'=>'Последние 100 человек которых вы пригласили',
    'friend_invite_info5'=>'Вы еще никого не приглашали.',

    //rating
    'rating_increase'=>'Повышения рейтинга',
    'rating_increase2'=>'Повысить рейтинг',
    'rating_info'=>'Введите ниже, на сколько Вы хотите повысить рейтинг. Обратите внимание, что услуга считается оказанной в момент зачисления рейтинга, возврат невозможен.',
    'you'=>'У Вас',
    'stays'=>'останется',
    'rating_history'=>'История повышения рейтинга',
    'rating_no_update'=>'Пока что никто не повышал Ваш рейтинг.',
    'rating_next'=>'Показать предыдущие повышения',

    //restore
    'restore'=>'Восстановление пароля',
    'restore_info'=>'Введите адрес электронной почты, который вы использовали для регистрации, чтобы восстановить пароль, или свяжитесь <a href="#">с нами,</a> если вам нужна помощь',
    'restore_send'=>'Отправить информацию',
    'restore_to_main'=>'Вернуться к входу',
    'whose_page'=>'Это та страница, к которой необходимо восстановить доступ?',
    'yes_page'=>'Да, это нужная страница',
    'restore_to_email'=>'На ваш электронный ящик были высланы инструкции по восстановлению пароля.',


    'Cats'=>'Gatos', // plural
    '%s is a nice cat'=>'%s es un buen gato',
    'lost_subj'						=> 'Восстановление доступа к странице',
);